app/views/book/edit.html.erb

  <p><label for="book_subject">Subject</label>
    <%= f.collection_select :subject_id, Subject.all, :id, :name, prompt: true %></p>
---
SELECT "subjects".* FROM "subjects"