app/controllers/book_controller.rb

  def list
    @books = Book.all
---
SELECT "books".* FROM "books"

  def show
    @book = Book.find(params[:id]);
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @book = Book.new
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def create
    @book = Book.new(book_params)

    if @book.save
      redirect_to :action => 'list'
    else
      @subjects = Subject.all
---
INSERT INTO "books" ("title", "isbn", "price", "author", "description", "subject_id", "created_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "My book"], ["isbn", "kadaijdaijd"], ["price", 300.0], ["author", "Thushan"], ["description", "Det ar min book"], ["subject_id", 3], ["created_at", "2018-03-07 05:54:42.180167"]]
SELECT "subjects".* FROM "subjects"

  def edit
    @book = Book.find(params[:id])
    @subjects = Subject.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"

  def update
    @book = Book.find(params[:id])
    if @book.update_attributes(book_param)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "price" = $1 WHERE "books"."id" = $2  [["price", 600.0], ["id", 1]]

  def delete
    Book.find(params[:id]).destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]